# Fifa19 Exercise - Solutions

Welcome to a quick exercise for you to practice your pandas skills! We will be using the [Fifa19 Dataset](https://www.kaggle.com/winterbreeze/fifa19eda) from Kaggle! Just follow along and complete the tasks outlined in bold below. The tasks will get harder and harder as you go along.

**Import pandas as pd.**

In [1]:
import pandas as pd
import os

**Read fifa_eda.csv as a dataframe called fifa.**

In [33]:
FILE_PATH= os.path.join(os.getcwd(),'fifa_eda.csv')
df = pd.read_csv(FILE_PATH)
df

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Preferred Foot,International Reputation,Skill Moves,Position,Joined,Contract Valid Until,Height,Weight,Release Clause
0,158023,L. Messi,31,Argentina,94,94,FC Barcelona,110500.0,565.0,Left,5.0,4.0,RF,2004,2021-01-01,5.583333,159.0,226500.0
1,20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,77000.0,405.0,Right,5.0,5.0,ST,2018,2022-01-01,6.166667,183.0,127100.0
2,190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,118500.0,290.0,Right,5.0,5.0,LW,2017,2022-01-01,5.750000,150.0,228100.0
3,193080,De Gea,27,Spain,91,93,Manchester United,72000.0,260.0,Right,4.0,1.0,GK,2011,2020-01-01,6.333333,168.0,138600.0
4,192985,K. De Bruyne,27,Belgium,91,92,Manchester City,102000.0,355.0,Right,4.0,4.0,RCM,2015,2023-01-01,5.916667,154.0,196400.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18202,238813,J. Lundstram,19,England,47,65,Crewe Alexandra,60.0,1.0,Right,1.0,2.0,CM,2017,2019-01-01,5.750000,134.0,143.0
18203,243165,N. Christoffersson,19,Sweden,47,63,Trelleborgs FF,60.0,1.0,Right,1.0,2.0,ST,2018,2020-01-01,6.250000,170.0,113.0
18204,241638,B. Worman,16,England,47,67,Cambridge United,60.0,1.0,Right,1.0,2.0,ST,2017,2021-01-01,5.666667,148.0,165.0
18205,246268,D. Walker-Rice,17,England,47,66,Tranmere Rovers,60.0,1.0,Right,1.0,2.0,RW,2018,2019-01-01,5.833333,154.0,143.0
18206,246269,G. Nugent,16,England,46,66,Tranmere Rovers,60.0,1.0,Right,1.0,2.0,CM,2018,2019-01-01,5.833333,176.0,165.0

**Check the head of the DataFrame.**

In [34]:
df.head()

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Preferred Foot,International Reputation,Skill Moves,Position,Joined,Contract Valid Until,Height,Weight,Release Clause
0,158023,L. Messi,31,Argentina,94,94,FC Barcelona,110500.0,565.0,Left,5.0,4.0,RF,2004,2021-01-01,5.583333,159.0,226500.0
1,20801,Cristiano Ronaldo,33,Portugal,94,94,Juventus,77000.0,405.0,Right,5.0,5.0,ST,2018,2022-01-01,6.166667,183.0,127100.0
2,190871,Neymar Jr,26,Brazil,92,93,Paris Saint-Germain,118500.0,290.0,Right,5.0,5.0,LW,2017,2022-01-01,5.750000,150.0,228100.0
3,193080,De Gea,27,Spain,91,93,Manchester United,72000.0,260.0,Right,4.0,1.0,GK,2011,2020-01-01,6.333333,168.0,138600.0
4,192985,K. De Bruyne,27,Belgium,91,92,Manchester City,102000.0,355.0,Right,4.0,4.0,RCM,2015,2023-01-01,5.916667,154.0,196400.0

**Use the .info() method to find out how many entries there are.**

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18207 entries, 0 to 18206
Data columns (total 18 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   ID                        18207 non-null  int64
 1   Name                      18207 non-null  object
 2   Age                       18207 non-null  int64
 3   Nationality               18207 non-null  object
 4   Overall                   18207 non-null  int64
 5   Potential                 18207 non-null  int64
 6   Club                      17966 non-null  object
 7   Value                     17955 non-null  float64
 8   Wage                      18207 non-null  float64
 9   Preferred Foot            18207 non-null  object
 10  International Reputation  18159 non-null  float64
 11  Skill Moves               18159 non-null  float64
 12  Position                  18207 non-null  object
 13  Joined                    18207 non-null  int64
 14  Contract Valid Until      17918 non-null  object
 15  Height                    18207 non-null  float64
 16  Weight                    18207 non-null  float64
 17  Release Clause            18207 non-null  float64
dtypes: float64(7), int64(5), object(6)
memory usage: 2.5+ MB

**Use the .describe() method to get some statistics for the numeric columns of the data**

In [36]:
df.describe()

,ID,Age,Overall,Potential,Value,Wage,International Reputation,Skill Moves,Joined,Height,Weight,Release Clause
count,18207.000000,18207.000000,18207.000000,18207.000000,17955.000000,18207.000000,18159.000000,18159.000000,18207.000000,18207.000000,18207.000000,18207.000000
mean,214298.338606,25.122206,66.238699,71.307299,2444.530214,9.731312,1.113222,2.361308,2016.420607,5.946771,165.979129,4585.060971
std,29965.244204,4.669943,6.908930,6.136496,5626.715434,21.999290,0.394031,0.756164,2.018194,0.220514,15.572775,10630.414430
min,16.000000,16.000000,46.000000,48.000000,10.000000,0.000000,1.000000,1.000000,1991.000000,5.083333,110.000000,13.000000
25%,200315.500000,21.000000,62.000000,67.000000,325.000000,1.000000,1.000000,2.000000,2016.000000,5.750000,154.000000,570.000000
50%,221759.000000,25.000000,66.000000,71.000000,700.000000,3.000000,1.000000,2.000000,2017.000000,5.916667,165.000000,1300.000000
75%,236529.500000,28.000000,71.000000,75.000000,2100.000000,9.000000,1.000000,3.000000,2018.000000,6.083333,176.000000,4585.060806
max,246620.000000,45.000000,94.000000,95.000000,118500.000000,565.000000,5.000000,5.000000,2018.000000,6.750000,243.000000,228100.000000

**Use the .describe() method to get some statistics for the numeric categorical of the data**

In [37]:
df.dtypes == object

ID                          False
Name                         True
Age                         False
Nationality                  True
Overall                     False
Potential                   False
Club                         True
Value                       False
Wage                        False
Preferred Foot               True
International Reputation    False
Skill Moves                 False
Position                     True
Joined                      False
Contract Valid Until         True
Height                      False
Weight                      False
Release Clause              False
dtype: bool

In [105]:
df.describe(include='all')

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Preferred Foot,International Reputation,Skill Moves,Position,Joined,Contract Valid Until,Height,Weight,Release Clause
count,18207.000000,18207,18207.000000,18207,18207.000000,18207.000000,17966,17955.000000,18207.000000,18207,18159.000000,18159.000000,18207,18207.000000,17918,18207.000000,18207.000000,18207.000000
unique,NaN,17194,NaN,164,NaN,NaN,651,NaN,NaN,2,NaN,NaN,27,NaN,35,NaN,NaN,NaN
top,NaN,J. RodrÃ­guez,NaN,England,NaN,NaN,FC Barcelona,NaN,NaN,Right,NaN,NaN,ST,NaN,2019-01-01,NaN,NaN,NaN
freq,NaN,11,NaN,1662,NaN,NaN,33,NaN,NaN,13996,NaN,NaN,2154,NaN,4870,NaN,NaN,NaN
mean,214298.338606,NaN,25.122206,NaN,66.238699,71.307299,NaN,2444.530214,9.731312,NaN,1.113222,2.361308,NaN,2016.420607,NaN,5.946771,165.979129,4585.060971
std,29965.244204,NaN,4.669943,NaN,6.908930,6.136496,NaN,5626.715434,21.999290,NaN,0.394031,0.756164,NaN,2.018194,NaN,0.220514,15.572775,10630.414430
min,16.000000,NaN,16.000000,NaN,46.000000,48.000000,NaN,10.000000,0.000000,NaN,1.000000,1.000000,NaN,1991.000000,NaN,5.083333,110.000000,13.000000
25%,200315.500000,NaN,21.000000,NaN,62.000000,67.000000,NaN,325.000000,1.000000,NaN,1.000000,2.000000,NaN,2016.000000,NaN,5.750000,154.000000,570.000000
50%,221759.000000,NaN,25.000000,NaN,66.000000,71.000000,NaN,700.000000,3.000000,NaN,1.000000,2.000000,NaN,2017.000000,NaN,5.916667,165.000000,1300.000000
75%,236529.500000,NaN,28.000000,NaN,71.000000,75.000000,NaN,2100.000000,9.000000,NaN,1.000000,3.000000,NaN,2018.000000,NaN,6.083333,176.000000,4585.060806
max,246620.000000,NaN,45.000000,NaN,94.000000,95.000000,NaN,118500.000000,565.000000,NaN,5.000000,5.000000,NaN,2018.000000,NaN,6.750000,243.000000,228100.000000

In [38]:
Categorical= ['Name','Nationality','Club','Preferred Foot','Position','Contract Valid Until' ]
df[Categorical].describe()

,Name,Nationality,Club,Preferred Foot,Position,Contract Valid Until
count,18207,18207,17966,18207,18207,17918
unique,17194,164,651,2,27,35
top,J. RodrÃ­guez,England,FC Barcelona,Right,ST,2019-01-01
freq,11,1662,33,13996,2154,4870

**What is the average Age ?**

In [39]:
df['Age'].mean()

25.122205745043114

**What is the greatest Height? and name of the player with that height?**

In [40]:
df.sort_values(by='Height' , ascending=False ).head(1)[['Name' , 'Height']]

          Name  Height
11614  T. HolÃ½    6.75

**What is the smallest weight? and name of the player with that weight? and for which club plays?**

In [41]:
df.sort_values(by='Weight' , ascending=True ).head(1)[['Name' , 'Weight']]

                Name  Weight
13338  B. Al Mutairi   110.0

**What is the position of Cristiano Ronaldo?**

In [ ]:
df['Position'].unique()

array(['RF', 'ST', 'LW', 'GK', 'RCM', 'LF', 'RS', 'RCB', 'LCM', 'CB',
       'LDM', 'CAM', 'CDM', 'LS', 'LCB', 'RM', 'LAM', 'LM', 'LB', 'RDM',
       'RW', 'CM', 'RB', 'RAM', 'CF', 'RWB', 'LWB'], dtype=object)

In [66]:
df[df['Name'] == 'Cristiano Ronaldo'][['Name','Position']]

                Name Position
1  Cristiano Ronaldo       ST

**What was the average (mean) Value of all players per year(Joined column) ?**

In [68]:
df.groupby('Joined')['Value'].mean()

Joined
1991      160.000000
1998      106.666667
1999       40.000000
2000      110.000000
2001      237.500000
2002     2351.250000
2003     1148.076923
2004    10415.833333
2005     5544.705882
2006     1208.055556
2007     4730.789474
2008     5377.924528
2009     3468.269231
2010     5240.839695
2011     4868.241206
2012     3840.988201
2013     4181.320961
2014     3549.077017
2015     3335.755988
2016     2511.245432
2017     2125.398374
2018     1913.759519
Name: Value, dtype: float64

**get Number of players for each club**

In [106]:
df.groupby('Club')['Name'].count()

Club
 SSV Jahn Regensburg     29
1. FC Heidenheim 1846    28
1. FC Kaiserslautern     26
1. FC KÃ¶ln               28
1. FC Magdeburg          26
                         ..
ZagÅ‚Ä™bie Sosnowiec       25
Ã‡aykur Rizespor          30
Ã–rebro SK                27
Ã–stersunds FK            22
ÅšlÄ…sk WrocÅ‚aw            25
Name: Name, Length: 651, dtype: int64

**How many unique Clubs are there?**

In [76]:
df['Club'].nunique()

651

**What are the top 5 most common positions?**

In [80]:
df['Position'].value_counts().head(5)

Position
ST    2154
GK    2027
CB    1779
CM    1395
LB    1372
Name: count, dtype: int64

**What are the top 5 most common nationality?**

In [81]:
df['Nationality'].value_counts().head(5)

Nationality
England      1662
Germany      1198
Spain        1072
Argentina     937
France        914
Name: count, dtype: int64

**What are the names of players has Egyptian Nationality?**

In [87]:
df[df['Nationality'] == 'Egypt'][['Name' , 'Nationality']]

                 Name Nationality
26           M. Salah       Egypt
752         Trezeguet       Egypt
959         M. Elneny       Egypt
1517        A. Hegazi       Egypt
2241        A. Hassan       Egypt
2259          Kahraba       Egypt
2334         R. Sobhi       Egypt
3310    A. Elmohamady       Egypt
3616         A. Warda       Egypt
3929        A. Ghazal       Egypt
4044         A. Tarek       Egypt
4217        Shikabala       Egypt
4504       A. El Said       Egypt
5614         A. Fathi       Egypt
5913         M. Hamdy       Egypt
5944         S. Morsy       Egypt
6021        A. Ashraf       Egypt
6407        S. Ekramy       Egypt
6717          A. Gabr       Egypt
6804         O. Gaber       Egypt
7102   M. Abdul Shafy       Egypt
8325        A. El-Abd       Egypt
8441         T. Hamed       Egypt
9165    M. El-Shenawy       Egypt
9228      H. El Sayed       Egypt
9297          M. Awad       Egypt
9514      A. Jakobsen       Egypt
9665         K. Hafez       Egypt
9911        M. Mohsen       Egypt
10672         M. Atwa       Egypt
13891      A. Mostafa       Egypt

**How many players joined in 2018 with skill moves=2?**

In [99]:
num=df['Joined'] == 2018
num.count()

18207

**How many players whom name starts with letter  'M'? (This is pretty tricky)**

In [101]:
df['Name'].str.startswith('M') .count()

18207

**Bonus: Is there a correlation between International Reputation and Wage?**

In [104]:
df[['International Reputation','Wage']].corr()

                          International Reputation      Wage
International Reputation                  1.000000  0.668635
Wage                                      0.668635  1.000000

# Great Job!